{
  "irVersion": "1.0",
  "project": "omnivoice",
  "repository": "https://github.com/plexusone/omnivoice",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.5.0",
      "date": "2026-03-01",
      "highlights": [
        { "description": "Batteries-included voice pipeline framework for Go with unified STT and TTS interfaces" },
        { "description": "Provider registry pattern - consumers only need to import omnivoice, not individual provider packages" },
        { "description": "Four providers registered: OpenAI, ElevenLabs, Deepgram, and Twilio" }
      ],
      "added": [
        { "description": "Unified `STTProvider` and `TTSProvider` type aliases re-exported from omnivoice-core", "commit": "545b928" },
        { "description": "`TranscriptionConfig` and `SynthesisConfig` types for provider-agnostic configuration", "commit": "545b928" },
        { "description": "`providers/all` package for importing all providers with a single blank import", "commit": "545b928" },
        { "description": "Provider registry with `RegisterTTSProvider` and `RegisterSTTProvider` for self-registration", "commit": "545b928" },
        { "description": "`GetTTSProvider(name, opts...)` and `GetSTTProvider(name, opts...)` for runtime provider creation", "commit": "545b928" },
        { "description": "`WithAPIKey`, `WithBaseURL`, and `WithExtension` options for provider configuration", "commit": "545b928" },
        { "description": "`ListTTSProviders()` and `ListSTTProviders()` to discover registered providers", "commit": "545b928" },
        { "description": "`HasTTSProvider()` and `HasSTTProvider()` to check provider availability", "commit": "545b928" },
        { "description": "Subtitle generation re-exported from omnivoice-core (`GenerateSRT`, `GenerateVTT`)", "commit": "545b928" }
      ],
      "changed": [
        { "description": "Version v0.5.0 continues from previous omnivoice v0.4.3 (now omnivoice-core) for Go module proxy compatibility" }
      ],
      "build": [
        { "description": "GitHub Actions workflows for CI, linting, and CodeQL security scanning", "commit": "95e8bbb" },
        { "description": "golangci-lint configuration with standard Go linting rules", "commit": "95e8bbb" },
        { "description": "Dependabot configuration for automated dependency updates", "commit": "95e8bbb" }
      ],
      "documentation": [
        { "description": "README with quick start guide, usage examples, and provider compatibility table", "commit": "1f2b810" },
        { "description": "Language codes reference table with BCP-47 examples", "commit": "9835ed7" },
        { "description": "Package documentation with godoc examples", "commit": "66a341b" },
        { "description": "CHANGELOG.json and CHANGELOG.md using structured-changelog format", "commit": "545b928" },
        { "description": "Release notes for v0.5.0", "commit": "545b928" }
      ],
      "dependencies": [
        { "description": "`github.com/plexusone/omnivoice-core` v0.5.0 - Core STT/TTS interfaces", "commit": "545b928" },
        { "description": "`github.com/plexusone/omnivoice-deepgram` v0.4.0 - Deepgram provider", "commit": "545b928" },
        { "description": "`github.com/plexusone/omnivoice-openai` v0.1.0 - OpenAI Whisper/TTS provider", "commit": "545b928" },
        { "description": "`github.com/plexusone/omnivoice-twilio` v0.2.0 - Twilio Media Streams provider", "commit": "545b928" },
        { "description": "`github.com/plexusone/elevenlabs-go` v0.9.0 - ElevenLabs provider", "commit": "545b928" }
      ]
    }
  ]
}
